# AnalyticalTransferSwitchData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalTransferSwitchData Properties
AnalyticalTransferSwitchData Class See Also
---
The AnalyticalTransferSwitchData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentRating | The current rating value of the electrical analytical transfer switch. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AnalyticalDistributionNodePropertyData.) |
| NumberOfPhases | The number of phases.  (Inherited from AnalyticalDistributionNodePropertyData.) |
| TotalConnectedCurrent | The total connected current of the electrical analytical transfer switch. |
| Voltage | The voltage value of the electrical analytical transfer switch. |

# See Also
AnalyticalTransferSwitchData Class
Autodesk.Revit.DB.Electrical Namespace